---
kind: property
id: P:Autodesk.Revit.DB.Architecture.StairsType.MaxRiserHeight
source: html/70999f80-decb-bdbb-d251-662dfcd1bf10.htm
---
# Autodesk.Revit.DB.Architecture.StairsType.MaxRiserHeight Property

The maximum height of each riser on the stair element.

## Syntax (C#)
```csharp
public double MaxRiserHeight { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The given value for maxRiserHeight must be greater than 0 and no more than 30000 feet.